Terraform Plan Output:
```
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Reading...
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_key.custom_s3_kms_key[0]: Refreshing state... [id=9bd4109d-e272-4131-9e9f-e41c3fc12a8b]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this: Refreshing state... [id=vaishnavi-25]
module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this: Refreshing state... [id=hello-kitty-role-Vaishnavi-M-25]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this: Refreshing state... [id=vaishnavi-25]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0]: Refreshing state... [id=alias/s3-vaishnavi-25]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=vaishnavi-25]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=vaishnavi-25]
module.appcd_7e8e0787-dd8b-4126-b83f-10babc9ea1e3.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-role-Vaishnavi-M-25:aws_s3-hello-kitty-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "hello-kitty-function-vaishnavi-25"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::222634395437:role/hello-kitty-role-Vaishnavi-M-25"
      + runtime                        = "python3.8"
      + s3_bucket                      = "stackgen-builds"
      + s3_key                         = "build/app.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "appstack"  = "hello kitty"
          + "component" = "hello-kitty"
        }
      + tags_all                       = {
          + "appstack"  = "hello kitty"
          + "component" = "hello-kitty"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "IMAGES_BUCKET" = "vaishnavi-25"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0] will be created
  + resource "aws_lambda_function_url" "this" {
      + authorization_type = "NONE"
      + function_arn       = (known after apply)
      + function_name      = "hello-kitty-function-vaishnavi-25"
      + function_url       = (known after apply)
      + id                 = (known after apply)
      + invoke_mode        = "BUFFERED"
      + url_id             = (known after apply)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0] must be replaced
-/+ resource "aws_kms_alias" "a" {
      ~ arn            = "arn:aws:kms:us-west-2:222634395437:alias/s3-vaishnavi-25" -> (known after apply)
      ~ id             = "alias/s3-vaishnavi-25" -> (known after apply)
      ~ name           = "alias/s3-vaishnavi-25" -> "alias/s3-vaishnavi25" # forces replacement
      + name_prefix    = (known after apply)
      ~ target_key_arn = "arn:aws:kms:us-west-2:222634395437:key/9bd4109d-e272-4131-9e9f-e41c3fc12a8b" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this must be replaced
-/+ resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::vaishnavi-25" -> (known after apply)
      ~ bucket                      = "vaishnavi-25" -> "vaishnavi25" # forces replacement
      ~ bucket_domain_name          = "vaishnavi-25.s3.amazonaws.com" -> (known after apply)
      + bucket_prefix               = (known after apply)
      ~ bucket_regional_domain_name = "vaishnavi-25.s3.us-west-2.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3BJ6K6RIION7M" -> (known after apply)
      ~ id                          = "vaishnavi-25" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-west-2" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "appstack"  = "hello kitty"
            "component" = "hello-kitty"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "142ffdd1f87132a598f0ca276babbb31f1f8672261731ae3635f0b84be07a341" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - kms_master_key_id = "9bd4109d-e272-4131-9e9f-e41c3fc12a8b" -> null
                  - sse_algorithm     = "aws:kms" -> null
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = true -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "this" {
      ~ bucket                  = "vaishnavi-25" -> (known after apply) # forces replacement
      ~ id                      = "vaishnavi-25" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0] must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "this" {
      ~ bucket                = "vaishnavi-25" -> (known after apply) # forces replacement
      ~ id                    = "vaishnavi-25" -> (known after apply)
        # (1 unchanged attribute hidden)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - kms_master_key_id = "9bd4109d-e272-4131-9e9f-e41c3fc12a8b" -> null
              - sse_algorithm     = "aws:kms" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = "9bd4109d-e272-4131-9e9f-e41c3fc12a8b"
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0] must be replaced
-/+ resource "aws_s3_bucket_versioning" "this" {
      ~ bucket                = "vaishnavi-25" -> (known after apply) # forces replacement
      ~ id                    = "vaishnavi-25" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.appcd_7e8e0787-dd8b-4126-b83f-10babc9ea1e3.aws_iam_role_policy.this will be updated in-place
  ~ resource "aws_iam_role_policy" "this" {
        id          = "hello-kitty-role-Vaishnavi-M-25:aws_s3-hello-kitty-policy"
        name        = "aws_s3-hello-kitty-policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "kms:Decrypt",
                          - "kms:Encrypt",
                          - "kms:GenerateDataKey",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:kms:us-west-2:222634395437:key/9bd4109d-e272-4131-9e9f-e41c3fc12a8b",
                        ]
                      - Sid      = "AllowKmsAccess"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:GetObjectVersion",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::vaishnavi-25",
                          - "arn:aws:s3:::vaishnavi-25/*",
                        ]
                      - Sid      = "hellokittyIMAGESBUCKETS3Bucket551e1d2b88ec540687cfc51521bbe894"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/hello-kitty-function"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "appstack"  = "hello kitty"
          + "component" = "hello-kitty"
        }
      + tags_all          = {
          + "appstack"  = "hello kitty"
          + "component" = "hello-kitty"
        }
    }

  # module.appcd_d67e9b62-8793-48d7-8da7-c06c92d011a0.aws_iam_role_policy.this will be created
  + resource "aws_iam_role_policy" "this" {
      + id          = (known after apply)
      + name        = "Writer"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "hello-kitty-role-Vaishnavi-M-25"
    }

Plan: 9 to add, 1 to change, 5 to destroy.

Changes to Outputs:
  + aws_cloudwatch_log_group_aws_lambda_hello_kitty_function_arn  = (known after apply)
  + aws_lambda_hello_kitty_function_vaishnavi_25_function_arn     = (known after apply)
  + aws_lambda_hello_kitty_function_vaishnavi_25_function_url     = (known after apply)
  + aws_lambda_hello_kitty_function_vaishnavi_25_invoke_arn       = (known after apply)
  + aws_s3_vaishnavi25_arn                                        = (known after apply)
  + aws_s3_vaishnavi25_bucket_name                                = (known after apply)
  + aws_s3_vaishnavi25_kms_arn                                    = "arn:aws:kms:us-west-2:222634395437:key/9bd4109d-e272-4131-9e9f-e41c3fc12a8b"
  - aws_s3_vaishnavi_25_arn                                       = "arn:aws:s3:::vaishnavi-25" -> null
  - aws_s3_vaishnavi_25_bucket_name                               = "vaishnavi-25" -> null
  - aws_s3_vaishnavi_25_kms_arn                                   = "arn:aws:kms:us-west-2:222634395437:key/9bd4109d-e272-4131-9e9f-e41c3fc12a8b" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```